/**
 * Created by Mr.Do on 2017/5/7.
 */
const lrc = {
    "小星星-杨千嬅": `作曲：陈辉阳@好好笑
        作词：林夕
        
        当天应该得7岁
        我想喝妈妈的汽水
        把它抢在掌心里 
        大人无法迫我睡
        
        他跟她今天竟饮醉 
        我想抢的不止汽水
        输光自尊也斗下去 
        压力大得欲望都失去
        
        一闪一闪小星星 
        开开心心的唱诗
        但为何一毕业才知 
        一世我也要考试
        
        谁也好 
        即使爱侣都没有必要待我好
        甜辣酸苦都一样当宝 
        谁亦会计数
        牺牲才得到的快乐 
        亦没什么味道
        难怪我双肋插了刀 
        为博他答谢也好
        仍没法开心得这样早 
        谁愿欠我一世人间散步
        善良人永远天真到 
        做好心不信得恶报
        
        终于都跟他分手了 
        我开过的心不算少
        今天起睡得够最重要 
        以后幸福亦未必敢笑
        
        谁也好 
        即使爱侣都没有必要待我好
        甜辣酸苦都一样当宝 
        谁亦会计数
        牺牲才得到的快乐 
        亦没什么味道
        难怪我双肋插了刀 
        为博他答谢也好
        仍没法开心得这样早 
        谁愿欠我一世人间散步
        善良人永远天真到 
        做好心不信得恶报
        一闪一闪小星星 
        简简单单一辈子
        就从头到尾哼一次 
        忘记智商去做人都愿意
    `   ,
    "给十年后的我-薛凯琪": `作曲：陈小霞
        作词：黄伟文
        
        这十年来做过的事
        能令你无悔 骄傲吗？
        那时候你所相信的事
        没有被动摇吧？
        对象和缘份已出现
        成就也还算不赖吗？
        旅途上你增添了经历
        又有让棱角　消失吗？
        
        软弱吗？
        你成熟了不会失去格调吧？
        当初坚持还在吗？
        刀锋不会磨钝了吧？
        老练吗？
        你情愿变得聪明而不冲动吗？
        但变成步步停下三思 
        会累吗？
        
        快乐吗？
        你还是记得你跟我约定吧？
        区区几场成败里
        应该不致 麻木了吧？
        快乐吗？
        你忘掉理想　只能忙於生活吗？
        别太迟　又十年後至想 
        快乐吗？
    `,
    "月球上的人-陈奕迅": `作曲：苏耀宗
        作词：林若宁
        
        无需要快乐 
        反正你一早枯死
        如果有眼泪 
        只不过生理分泌
        就算泪水多得可灌溉整片湿地
        蒲公英不会飞 
        陵墓里伴你于一起
        
        如果有再会 
        恐怕已经一世纪
        回忆哄骗我 
        但凡失去也是美
        用你一分钟都足够我生醉梦死
        如怀念也是有它限期 
        明日我便记不起
        
        从未来再见 
        遗憾旧时不太会恋爱
        愿我永远记不得我正身处现在
        从月球观看 
        难辨地球相爱跟错爱
        三世书不会记载 
        缠系我这半生的最爱
        
        时空太过大 
        超脱我的喜与悲
        人恋爱过后 
        自然参透到命理
        就算一双手 
        只拥抱你的纪念碑
        留离在某月某天某地 
        仍自觉共你一起
        
        从未来再见 
        遗憾旧时不太会恋爱
        愿我永远记不得我正身处现在
        从月球观看 
        难辨地球相爱跟错爱
        三世书不会记载 
        谁为某某叹息感慨
        再见 仍旧未能跟你再恋爱
        但你与我有过的过去牵涉后代
        从未来观看 
        潜伏万年的野史记载
        不理它小爱与大爱 
        人类太过渺少的最爱
    `,
    "山丘-李宗盛": `作曲：李宗盛
        作词：李宗盛
        
        想说却还没说的 还很多
        攒着是因为想写成歌
        让人轻轻地唱着 淡淡地记着
        就算终于忘了 也值了
        
        说不定我一生涓滴意念
        侥幸汇成河
        然后我俩各自一端
        望着大河弯弯 终于敢放胆
        嘻皮笑脸 面对 人生的难
        
        也许我们从未成熟
        还没能晓得 就快要老了
        尽管心里活着的还是那个
        年轻人
        因为不安而频频回首
        无知地索求 羞耻于求救
        不知疲倦地翻越 每一个山丘
        
        越过山丘 虽然已白了头
        喋喋不休 时不我予的哀愁
        还未如愿见着不朽
        就把自己先搞丢
        
        越过山丘 才发现无人等候
        喋喋不休 再也唤不回温柔
        为何记不得上一次是谁给的拥抱
        在什么时候
        
        我没有刻意隐藏 也无意让你感伤
        多少次我们无醉不欢
        咒骂人生太短 唏嘘相见恨晚
        让女人把妆哭花了 也不管
        
        遗憾我们从未成熟
        还没能晓得 就已经老了
        尽力却仍不明白
        身边的年轻人
        给自己随便找个理由
        向情爱的挑逗 命运的左右
        不自量力地还手 直至死方休
        
        越过山丘 虽然已白了头
        喋喋不休 时不我予的哀愁
        还未如愿见着不朽
        就把自己先搞丢
        
        越过山丘 才发现无人等候
        喋喋不休 再也唤不回了温柔
        为何记不得上一次是谁给的拥抱
        在什么时候
        
        越过山丘 虽然已白了头
        喋喋不休 时不我予的哀愁
        还未如愿见着不朽
        就把自己先搞丢
        
        越过山丘 才发现无人等候
        喋喋不休 再也唤不回了温柔
        为何记不得上一次是谁给的拥抱
        在什么时候
        
        喋喋不休 时不我予的哀愁
        向情爱的挑逗 命运的左右
        不自量力地还手 直至死方休
        为何记不得上一次是谁给的拥抱
        在什么时候
    `,
    "致少年时代-古巨基": `作曲：方皓玟
        作词：林夕
        
        爱少年时代 放肆而无害
        最爱着拖鞋跑屋邨似障碍赛
        然后最怕背书里未懂装懂的感慨
        未料到将来 
        那强说的愁 
        已情怀不再
        
        羡慕你想哭与笑时哭与笑永未顾忌
        烦人烦事不爱理便不去理 自闭天地
        冥顽无知 却更会自由做你自己
        只要想逃避 被窝总可以抱紧你
        
        爱偶像年代 会疯狂期待
        最爱看颁奖礼歌星要角逐比赛
        还道最痛像高处荡千秋摔伤膝盖
        痛那么单纯 
        爱那么轻易 
        幼稚而可爱
        
        羡慕你想哭与笑时哭与笑永未顾忌
        烦人烦事不爱理便不去理 自闭天地
        冥顽无知 却更会自由做你自己
        只要想逃避 被窝总可以抱紧你
        
        从前全为怕考试渴望能大个
        今日我 偏担起更深功课
        嫌从前未算闯够祸亦无悔当初
        成熟催促爱玩的你 已懂得太多
        
        妒忌你能想发泄时敢发泄拒绝皱眉
        明明还未懂世故幻想世态无数滋味
        明明无知 世界却又原谅你自欺
        转眼天和地 便一板一眼约束你
        假设可重遇 让今天的我轻抚你
    `,
    "情人-Beyond": `作曲：黄家驹
        作词：刘卓辉
        
        盼望你没有为我又再度暗中淌泪
        我不想留低 你的心空虚
        盼望你别再让我象背负太深的罪
        我的心如水 你不必痴醉
        Woo 你可知 谁甘心归去
        你与我之间有谁
        
        是缘是情是童真 还是意外
        有泪有罪有付出 还有忍耐
        是人是墙是寒冬 藏在眼内
        有日有夜有幻想 无法等待
        
        盼望我别去后会共你在远方相聚
        每一天望海 每一天相对
        盼望你现已没有让我别去的恐惧
        我即使离开 你的天空里
        Woo 你可知 谁甘心归去
        你与我之间有谁
        
        是缘是情是童真 还是意外
        有泪有罪有付出 还有忍耐
        是人是墙是寒冬 藏在眼内
        有日有夜有幻想 无法等待
        
        多少春秋风雨改
        多少崎岖不变爱
        多少唏嘘的你在人海
        
        是缘是情是童真 还是意外
        有泪有罪有付出 还有忍耐
        是人是墙是寒冬 藏在眼内
        有日有夜有幻想 无法等待
    `,
}